"""
 + `AlgsList`: псевдоним типа для списка алгоритмов
 + `KEYWORDS`: ключевые слова
 + `TYPES`: названия типов
"""
from typing import TypeAlias

AlgsList: TypeAlias = dict[
    str,
    tuple[
        list[tuple[str, str, str]],
        str,
        list[list]
    ]
]

KEYWORDS = {
    'алг',
    'нач',
    'дано',
    'надо',
    'кон',
    'если',
    'то',
    'иначе',
    'все',
    'нц',
    'кц',
    'кц_при',
    'раз',
    'пока',
    'для',
    'от',
    'до',
    'шаг',
    'при',
    'выбор',
    'арг',
    'рез',
    'аргрез',
    'использовать',
    'ввод',
    'вывод',
    'выход',
    'утв',
    'стоп',
    'да',
    'нет',
    'нс',
}
TYPES = {
    'цел',
    'вещ',
    'сим',
    'лит',
    'лог',
    'файл',
    'целтаб',
    'вещтаб',
    'симтаб',
    'литтаб',
    'логтаб',
    'таб',
}
